order_service/app/controllers/orders_controller.rb

SELECT "orders".* FROM "orders"
---
  def index
    #get all the orders in the database
    @orders = Order.all

SELECT "line_items".* FROM "line_items" WHERE "line_items"."order_id" = ?  [["order_id", 1]]
SELECT "line_items".* FROM "line_items" WHERE "line_items"."order_id" = ?  [["order_id", 2]]
---
  def show
    #get all the order_items for a specific order
    @order_items = LineItem.where({order_id: params[:id]}).all
    if @order_items.length > 0

SELECT "orders".* FROM "orders" WHERE "orders"."user_id" = ? AND "orders"."status" = ? LIMIT ?  [["user_id", 4], ["status", "cart"], ["LIMIT", 1]]
SELECT "line_items".* FROM "line_items" WHERE "line_items"."product_id" = ? AND "line_items"."order_id" = ? LIMIT ?  [["product_id", nil], ["order_id", 1], ["LIMIT", 1]]
UPDATE "orders" SET "total_price" = ?, "updated_at" = ? WHERE "orders"."id" = ?  [["total_price", 150.0], ["updated_at", "2023-11-28 06:56:37.877559"], ["id", 1]]
UPDATE "line_items" SET "price" = ?, "updated_at" = ? WHERE "line_items"."id" = ?  [["price", 60.0], ["updated_at", "2023-11-28 09:38:54.603055"], ["id", 2]]
INSERT INTO "orders" ("user_id", "status", "total_price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["user_id", 4], ["status", "cart"], ["total_price", 0.0], ["created_at", "2023-11-28 05:47:40.027950"], ["updated_at", "2023-11-28 05:47:40.027950"]]
UPDATE "line_items" SET "quantity" = ?, "updated_at" = ? WHERE "line_items"."id" = ?  [["quantity", 5], ["updated_at", "2023-11-28 07:31:44.316399"], ["id", 2]]
INSERT INTO "line_items" ("order_id", "product_id", "quantity", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"  [["order_id", 1], ["product_id", 1], ["quantity", 10], ["price", 50.0], ["created_at", "2023-11-28 09:50:02.437417"], ["updated_at", "2023-11-28 09:50:02.437417"]]
---
  def create
    # Find or initialize the order if it doesn't exist
    @order = Order.find_or_initialize_by(user_id: @current_user_id, status: "cart")

    @line_item = LineItem.find_by({product_id: order_params[:product_id], order_id: @order.id})

    if @line_item
      # find the product in the line items collection, and update the quantity if it exists
      @line_item.update({
        quantity: @line_item.quantity.to_i + order_params[:quantity].to_i,
        price: order_params[:price]
      })
    else
      # if it doesn't exist then create a new line items array for the order
      @line_item = @order.line_items.build({
        product_id: order_params[:product_id],
        quantity: order_params[:quantity],
        price: order_params[:price]
      })
    end

    if @order.save

SELECT "line_items".* FROM "line_items" WHERE "line_items"."product_id" = ? AND "line_items"."order_id" = ? LIMIT ?  [["product_id", 2], ["order_id", 1], ["LIMIT", 1]]
UPDATE "orders" SET "total_price" = ?, "updated_at" = ? WHERE "orders"."id" = ?  [["total_price", 310.0], ["updated_at", "2023-11-28 07:31:44.331876"], ["id", 1]]
UPDATE "line_items" SET "quantity" = ?, "updated_at" = ? WHERE "line_items"."id" = ?  [["quantity", 10], ["updated_at", "2023-11-28 09:45:30.444131"], ["id", 2]]
---
  def update
    @line_item = LineItem.find_by({product_id: order_params[:product_id], order_id: params[:id]})
    #if line_item exists then only it should update
    if @line_item.update({
      quantity: order_params[:quantity],
    })

SELECT "orders".* FROM "orders" WHERE "orders"."id" = ? AND "orders"."user_id" = ? AND "orders"."status" = ? LIMIT ?  [["id", 1], ["user_id", 4], ["status", "cart"], ["LIMIT", 1]]
SELECT "line_items".* FROM "line_items" WHERE "line_items"."product_id" = ? AND "line_items"."order_id" = ? LIMIT ?  [["product_id", 1], ["order_id", 1], ["LIMIT", 1]]
DELETE FROM "line_items" WHERE "line_items"."id" = ?  [["id", 2]]
SELECT "line_items".* FROM "line_items" WHERE "line_items"."order_id" = ?  [["order_id", 1]]
---
  def destroy
    @order = Order.find_by({id: params[:id], user_id: @current_user_id, status: "cart"})
    @line_item = @order.line_items.find_by({product_id: order_params[:product_id]})
    if @order.line_items.length > 1 && @line_item.destroy