product_service/app/controllers/products_controller.rb

INSERT INTO "products" ("name", "description", "price", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "screenshots"], ["description", "Screenshots in my laptop"], ["price", 12.0], ["created_at", "2023-11-29 09:04:01.310574"], ["updated_at", "2023-11-29 09:04:01.310574"]]
---
  def create
      @product = Product.new(product_params)

      if @product.save

UPDATE "products" SET "price" = $1, "updated_at" = $2 WHERE "products"."id" = $3  [["price", "25.0"], ["updated_at", "2023-11-24 06:16:31.260349"], ["id", 1]]
---
  def update
      if @product.update(product_params)